RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_sysctl_regs.h
/*
 * HALT (RW)
 *
 * halt request for CPU0,
 * 0: CPU0 will start to execute after reset or receive wakeup request
 * 1: CPU0 will not start after reset, or wakeup after WFI
 */
#define SYSCTL_CPU_LP_HALT_MASK (0x10000UL)
#define SYSCTL_CPU_LP_HALT_SHIFT (16U)
#define SYSCTL_CPU_LP_HALT_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_HALT_SHIFT) & SYSCTL_CPU_LP_HALT_MASK)
#define SYSCTL_CPU_LP_HALT_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_HALT_MASK) >> SYSCTL_CPU_LP_HALT_SHIFT)

/*
 * WAKE (RO)
 *
 * CPU0 is waking up
 * 0: CPU0 wake up not asserted
 * 1: CPU0 wake up asserted
 */
#define SYSCTL_CPU_LP_WAKE_MASK (0x2000U)
#define SYSCTL_CPU_LP_WAKE_SHIFT (13U)
#define SYSCTL_CPU_LP_WAKE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_WAKE_MASK) >> SYSCTL_CPU_LP_WAKE_SHIFT)

/*
 * EXEC (RO)
 *
 * CPU0 is executing
 * 0: CPU0 is not executing
 * 1: CPU0 is executing
 */
#define SYSCTL_CPU_LP_EXEC_MASK (0x1000U)
#define SYSCTL_CPU_LP_EXEC_SHIFT (12U)
#define SYSCTL_CPU_LP_EXEC_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_EXEC_MASK) >> SYSCTL_CPU_LP_EXEC_SHIFT)

/*
 * WAKE_FLAG (RW)
 *
 * CPU0 wakeup flag, indicate a wakeup event got active, write 1 to clear this bit
 * 0: CPU0 wakeup not happened
 * 1: CPU0 wake up happened
 */
#define SYSCTL_CPU_LP_WAKE_FLAG_MASK (0x400U)
#define SYSCTL_CPU_LP_WAKE_FLAG_SHIFT (10U)
#define SYSCTL_CPU_LP_WAKE_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_WAKE_FLAG_SHIFT) & SYSCTL_CPU_LP_WAKE_FLAG_MASK)
#define SYSCTL_CPU_LP_WAKE_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_WAKE_FLAG_MASK) >> SYSCTL_CPU_LP_WAKE_FLAG_SHIFT)

/*
 * SLEEP_FLAG (RW)
 *
 * CPU0 sleep flag, indicate a sleep event got active, write 1 to clear this bit
 * 0: CPU0 sleep not happened
 * 1: CPU0 sleep happened
 */
#define SYSCTL_CPU_LP_SLEEP_FLAG_MASK (0x200U)
#define SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT (9U)
#define SYSCTL_CPU_LP_SLEEP_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT) & SYSCTL_CPU_LP_SLEEP_FLAG_MASK)
#define SYSCTL_CPU_LP_SLEEP_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_SLEEP_FLAG_MASK) >> SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT)

/*
 * RESET_FLAG (RW)
 *
 * CPU0 reset flag, indicate a reset event got active, write 1 to clear this bit
 * 0: CPU0 reset not happened
 * 1: CPU0 reset happened
 */
#define SYSCTL_CPU_LP_RESET_FLAG_MASK (0x100U)
#define SYSCTL_CPU_LP_RESET_FLAG_SHIFT (8U)
#define SYSCTL_CPU_LP_RESET_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_RESET_FLAG_SHIFT) & SYSCTL_CPU_LP_RESET_FLAG_MASK)
#define SYSCTL_CPU_LP_RESET_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_RESET_FLAG_MASK) >> SYSCTL_CPU_LP_RESET_FLAG_SHIFT)

/*
 * MODE (RW)
 *
 * Low power mode, system behavior after WFI
 * 00: CPU clock stop after WFI
 * 01: System enter low power mode after WFI
 * 10: Keep running after WFI
 * 11: reserved
 */
#define SYSCTL_CPU_LP_MODE_MASK (0x3U)
#define SYSCTL_CPU_LP_MODE_SHIFT (0U)
#define SYSCTL_CPU_LP_MODE_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_MODE_SHIFT) & SYSCTL_CPU_LP_MODE_MASK)
#define SYSCTL_CPU_LP_MODE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_MODE_MASK) >> SYSCTL_CPU_LP_MODE_SHIFT)

/* Bitfield definition for register of struct array CPU: LOCK */
/*
 * GPR (RW)
 *
 * Lock bit for CPU_DATA0 to CPU_DATA13, once set, this bit will not clear untile next reset
 */
#define SYSCTL_CPU_LOCK_GPR_MASK (0xFFFCU)
#define SYSCTL_CPU_LOCK_GPR_SHIFT (2U)
#define SYSCTL_CPU_LOCK_GPR_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LOCK_GPR_SHIFT) & SYSCTL_CPU_LOCK_GPR_MASK)
#define SYSCTL_CPU_LOCK_GPR_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LOCK_GPR_MASK) >> SYSCTL_CPU_LOCK_GPR_SHIFT)

/*
 * LOCK (RW)
 *
 * Lock bit for CPU_LOCK
 */
#define SYSCTL_CPU_LOCK_LOCK_MASK (0x2U)
#define SYSCTL_CPU_LOCK_LOCK_SHIFT (1U)
#define SYSCTL_CPU_LOCK_LOCK_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LOCK_LOCK_SHIFT) & SYSCTL_CPU_LOCK_LOCK_MASK)
#define SYSCTL_CPU_LOCK_LOCK_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LOCK_LOCK_MASK) >> SYSCTL_CPU_LOCK_LOCK_SHIFT)

/* Bitfield definition for register of struct array CPU: GPR0 */
/*
 * GPR (RW)
 *
 * register for software to handle resume, can save resume address or status
 */
#define SYSCTL_CPU_GPR_GPR_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_GPR_GPR_SHIFT (0U)
#define SYSCTL_CPU_GPR_GPR_SET(x) (((uint32_t)(x) << SYSCTL_CPU_GPR_GPR_SHIFT) & SYSCTL_CPU_GPR_GPR_MASK)
#define SYSCTL_CPU_GPR_GPR_GET(x) (((uint32_t)(x) & SYSCTL_CPU_GPR_GPR_MASK) >> SYSCTL_CPU_GPR_GPR_SHIFT)

/* Bitfield definition for register of struct array CPU: STATUS0 */
/*
 * STATUS (RO)
 *
 * IRQ values
 */
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_SHIFT (0U)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_GET(x) (((uint32_t)(x) & SYSCTL_CPU_WAKEUP_STATUS_STATUS_MASK) >> SYSCTL_CPU_WAKEUP_STATUS_STATUS_SHIFT)

/* Bitfield definition for register of struct array CPU: ENABLE0 */
/*
 * ENABLE (RW)
 *
 * IRQ wakeup enable
 */
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT (0U)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SET(x) (((uint32_t)(x) << SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT) & SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK) >> SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT)



/* RESOURCE register group index macro definition */
#define SYSCTL_RESOURCE_CPU0 (0UL)
#define SYSCTL_RESOURCE_CPX0 (1UL)
#define SYSCTL_RESOURCE_POW_VIS (21UL)
#define SYSCTL_RESOURCE_POW_CPU0 (22UL)
#define SYSCTL_RESOURCE_POW_GPU (23UL)
#define SYSCTL_RESOURCE_RST_SOC (25UL)
#define SYSCTL_RESOURCE_RST_CON (26UL)
#define SYSCTL_RESOURCE_RST_VIS (27UL)
#define SYSCTL_RESOURCE_RST_CPU0 (28UL)
#define SYSCTL_RESOURCE_RST_GPU (29UL)
#define SYSCTL_RESOURCE_CLK_SRC_XTAL (32UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0 (33UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL0 (34UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1 (35UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL1 (36UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL1 (37UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2 (38UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL2 (39UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL2 (40UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL3 (41UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL3 (42UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL4 (43UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL4 (44UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0_REF (45UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1_REF (46UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2_REF (47UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL3_REF (48UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL4_REF (49UL)
#define SYSCTL_RESOURCE_CLK_TOP_CPU0 (64UL)
#define SYSCTL_RESOURCE_CLK_TOP_MCT0 (65UL)
#define SYSCTL_RESOURCE_CLK_TOP_GPU0 (66UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXIF (67UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXIS (68UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXIC (69UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXIV (70UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXID (71UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN0 (72UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN1 (73UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN2 (74UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN3 (75UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN4 (76UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN5 (77UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN6 (78UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN7 (79UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN0 (80UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN1 (81UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN2 (82UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN3 (83UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN4 (84UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN5 (85UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN6 (86UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN7 (87UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C0 (88UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C1 (89UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C2 (90UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C3 (91UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI0 (92UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI1 (93UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI2 (94UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI3 (95UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT0 (96UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT1 (97UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT2 (98UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT3 (99UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT4 (100UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT5 (101UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT6 (102UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT7 (103UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR0 (104UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR1 (105UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR2 (106UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR3 (107UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR4 (108UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR5 (109UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR6 (110UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR7 (111UL)
#define SYSCTL_RESOURCE_CLK_TOP_XPI0 (112UL)
#define SYSCTL_RESOURCE_CLK_TOP_XRAM (113UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA0 (114UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA1 (115UL)
#define SYSCTL_RESOURCE_CLK_TOP_AUD0 (116UL)
#define SYSCTL_RESOURCE_CLK_TOP_AUD1 (117UL)
#define SYSCTL_RESOURCE_CLK_TOP_AUD2 (118UL)
#define SYSCTL_RESOURCE_CLK_TOP_AUD3 (119UL)
#define SYSCTL_RESOURCE_CLK_TOP_ETH0 (120UL)
#define SYSCTL_RESOURCE_CLK_TOP_PTP0 (121UL)
#define SYSCTL_RESOURCE_CLK_TOP_SDC0 (122UL)
#define SYSCTL_RESOURCE_CLK_TOP_SDC1 (123UL)
#define SYSCTL_RESOURCE_CLK_TOP_NTM0 (124UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF0 (125UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF1 (126UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAM0 (127UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAM1 (128UL)
#define SYSCTL_RESOURCE_CLK_TOP_LCD0 (129UL)
#define SYSCTL_RESOURCE_CLK_TOP_LCD1 (130UL)
#define SYSCTL_RESOURCE_CLK_TOP_CSI0 (131UL)
#define SYSCTL_RESOURCE_CLK_TOP_CSI1 (132UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC0 (133UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC1 (134UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2S0 (135UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2S1 (136UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2S2 (137UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2S3 (138UL)
#define SYSCTL_RESOURCE_AXIS (256UL)
#define SYSCTL_RESOURCE_AXIC (257UL)
#define SYSCTL_RESOURCE_AXIV (258UL)
#define SYSCTL_RESOURCE_AXIG (259UL)
#define SYSCTL_RESOURCE_LMM0 (260UL)
#define SYSCTL_RESOURCE_MCT0 (261UL)
#define SYSCTL_RESOURCE_ROM0 (262UL)
#define SYSCTL_RESOURCE_DDR0 (263UL)
#define SYSCTL_RESOURCE_XRAM (264UL)
#define SYSCTL_RESOURCE_CAN0 (265UL)
#define SYSCTL_RESOURCE_CAN1 (266UL)
#define SYSCTL_RESOURCE_CAN2 (267UL)
#define SYSCTL_RESOURCE_CAN3 (268UL)
#define SYSCTL_RESOURCE_CAN4 (269UL)
#define SYSCTL_RESOURCE_CAN5 (270UL)
#define SYSCTL_RESOURCE_CAN6 (271UL)
#define SYSCTL_RESOURCE_CAN7 (272UL)
#define SYSCTL_RESOURCE_PTPC (273UL)
#define SYSCTL_RESOURCE_CRC0 (274UL)
#define SYSCTL_RESOURCE_OAMP (275UL)
#define SYSCTL_RESOURCE_LIN0 (276UL)
#define SYSCTL_RESOURCE_LIN1 (277UL)
#define SYSCTL_RESOURCE_LIN2 (278UL)
#define SYSCTL_RESOURCE_LIN3 (279UL)
#define SYSCTL_RESOURCE_LIN4 (280UL)
#define SYSCTL_RESOURCE_LIN5 (281UL)
#define SYSCTL_RESOURCE_LIN6 (282UL)
#define SYSCTL_RESOURCE_LIN7 (283UL)
#define SYSCTL_RESOURCE_I2C0 (284UL)
#define SYSCTL_RESOURCE_I2C1 (285UL)
#define SYSCTL_RESOURCE_I2C2 (286UL)
#define SYSCTL_RESOURCE_I2C3 (287UL)
#define SYSCTL_RESOURCE_SPI0 (288UL)
#define SYSCTL_RESOURCE_SPI1 (289UL)
#define SYSCTL_RESOURCE_SPI2 (290UL)
#define SYSCTL_RESOURCE_SPI3 (291UL)
#define SYSCTL_RESOURCE_URT0 (292UL)
#define SYSCTL_RESOURCE_URT1 (293UL)
#define SYSCTL_RESOURCE_URT2 (294UL)
#define SYSCTL_RESOURCE_URT3 (295UL)
#define SYSCTL_RESOURCE_URT4 (296UL)
#define SYSCTL_RESOURCE_URT5 (297UL)
#define SYSCTL_RESOURCE_URT6 (298UL)
#define SYSCTL_RESOURCE_URT7 (299UL)
#define SYSCTL_RESOURCE_WDG0 (300UL)
#define SYSCTL_RESOURCE_WDG1 (301UL)
#define SYSCTL_RESOURCE_MBX0 (302UL)
#define SYSCTL_RESOURCE_MBX1 (303UL)
#define SYSCTL_RESOURCE_TMR0 (304UL)
#define SYSCTL_RESOURCE_TMR1 (305UL)
#define SYSCTL_RESOURCE_TMR2 (306UL)
#define SYSCTL_RESOURCE_TMR3 (307UL)
#define SYSCTL_RESOURCE_TMR4 (308UL)
#define SYSCTL_RESOURCE_TMR5 (309UL)
#define SYSCTL_RESOURCE_TMR6 (310UL)
#define SYSCTL_RESOURCE_TMR7 (311UL)
#define SYSCTL_RESOURCE_I2S0 (312UL)
#define SYSCTL_RESOURCE_I2S1 (313UL)
#define SYSCTL_RESOURCE_I2S2 (314UL)
#define SYSCTL_RESOURCE_I2S3 (315UL)
#define SYSCTL_RESOURCE_PDM0 (316UL)
#define SYSCTL_RESOURCE_DAO0 (317UL)
#define SYSCTL_RESOURCE_SMIX (318UL)
#define SYSCTL_RESOURCE_RNG0 (319UL)
#define SYSCTL_RESOURCE_SDP0 (320UL)
#define SYSCTL_RESOURCE_KMAN (321UL)
#define SYSCTL_RESOURCE_GPIO (322UL)
#define SYSCTL_RESOURCE_ADC0 (323UL)
#define SYSCTL_RESOURCE_ADC1 (324UL)
#define SYSCTL_RESOURCE_SDM0 (325UL)
#define SYSCTL_RESOURCE_HDMA (326UL)
#define SYSCTL_RESOURCE_XDMA (327UL)
#define SYSCTL_RESOURCE_XPI0 (328UL)
#define SYSCTL_RESOURCE_FFA0 (329UL)
#define SYSCTL_RESOURCE_TSNS (330UL)
#define SYSCTL_RESOURCE_ETH0 (331UL)
#define SYSCTL_RESOURCE_USB0 (332UL)
#define SYSCTL_RESOURCE_SDC0 (333UL)
#define SYSCTL_RESOURCE_SDC1 (334UL)
#define SYSCTL_RESOURCE_NTM0 (335UL)
#define SYSCTL_RESOURCE_REF0 (336UL)
#define SYSCTL_RESOURCE_REF1 (337UL)
#define SYSCTL_RESOURCE_CAM0 (338UL)
#define SYSCTL_RESOURCE_CAM1 (339UL)
#define SYSCTL_RESOURCE_PDMA (340UL)
#define SYSCTL_RESOURCE_JPEG (341UL)
#define SYSCTL_RESOURCE_LCD0 (342UL)
#define SYSCTL_RESOURCE_LCD1 (343UL)
#define SYSCTL_RESOURCE_GWC0 (344UL)
#define SYSCTL_RESOURCE_GWC1 (345UL)
#define SYSCTL_RESOURCE_CSI0 (346UL)
#define SYSCTL_RESOURCE_CSI1 (347UL)
#define SYSCTL_RESOURCE_DSI0 (348UL)
#define SYSCTL_RESOURCE_DSI1 (349UL)
#define SYSCTL_RESOURCE_LVB0 (350UL)
#define SYSCTL_RESOURCE_LCB0 (351UL)
#define SYSCTL_RESOURCE_GPU0 (352UL)

/* GROUP0 register group index macro definition */
#define SYSCTL_GROUP0_LINK0 (0UL)
#define SYSCTL_GROUP0_LINK1 (1UL)
#define SYSCTL_GROUP0_LINK2 (2UL)
#define SYSCTL_GROUP0_LINK3 (3UL)

/* AFFILIATE register group index macro definition */
#define SYSCTL_AFFILIATE_CPU0 (0UL)

