RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_sysctl_regs.h
/* RETENTION register group index macro definition */
#define SYSCTL_RETENTION_CPU0 (0UL)

/* POWER register group index macro definition */
#define SYSCTL_POWER_VIS (0UL)
#define SYSCTL_POWER_CPU0 (1UL)
#define SYSCTL_POWER_GPU (2UL)

/* RESET register group index macro definition */
#define SYSCTL_RESET_SOC (0UL)
#define SYSCTL_RESET_CON (1UL)
#define SYSCTL_RESET_VIS (2UL)
#define SYSCTL_RESET_CPU0 (3UL)
#define SYSCTL_RESET_GPU (4UL)

/* CLOCK register group index macro definition */
#define SYSCTL_CLOCK_CLK_TOP_CPU0 (0UL)
#define SYSCTL_CLOCK_CLK_TOP_MCT0 (1UL)
#define SYSCTL_CLOCK_CLK_TOP_GPU0 (2UL)
#define SYSCTL_CLOCK_CLK_TOP_AXIF (3UL)
#define SYSCTL_CLOCK_CLK_TOP_AXIS (4UL)
#define SYSCTL_CLOCK_CLK_TOP_AXIC (5UL)
#define SYSCTL_CLOCK_CLK_TOP_AXIV (6UL)
#define SYSCTL_CLOCK_CLK_TOP_AXID (7UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN0 (8UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN1 (9UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN2 (10UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN3 (11UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN4 (12UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN5 (13UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN6 (14UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN7 (15UL)
#define SYSCTL_CLOCK_CLK_TOP_LIN0 (16UL)
#define SYSCTL_CLOCK_CLK_TOP_LIN1 (17UL)
#define SYSCTL_CLOCK_CLK_TOP_LIN2 (18UL)
#define SYSCTL_CLOCK_CLK_TOP_LIN3 (19UL)
#define SYSCTL_CLOCK_CLK_TOP_LIN4 (20UL)
#define SYSCTL_CLOCK_CLK_TOP_LIN5 (21UL)
#define SYSCTL_CLOCK_CLK_TOP_LIN6 (22UL)
#define SYSCTL_CLOCK_CLK_TOP_LIN7 (23UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C0 (24UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C1 (25UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C2 (26UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C3 (27UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI0 (28UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI1 (29UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI2 (30UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI3 (31UL)
#define SYSCTL_CLOCK_CLK_TOP_URT0 (32UL)
#define SYSCTL_CLOCK_CLK_TOP_URT1 (33UL)
#define SYSCTL_CLOCK_CLK_TOP_URT2 (34UL)
#define SYSCTL_CLOCK_CLK_TOP_URT3 (35UL)
#define SYSCTL_CLOCK_CLK_TOP_URT4 (36UL)
#define SYSCTL_CLOCK_CLK_TOP_URT5 (37UL)
#define SYSCTL_CLOCK_CLK_TOP_URT6 (38UL)
#define SYSCTL_CLOCK_CLK_TOP_URT7 (39UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR0 (40UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR1 (41UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR2 (42UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR3 (43UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR4 (44UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR5 (45UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR6 (46UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR7 (47UL)
#define SYSCTL_CLOCK_CLK_TOP_XPI0 (48UL)
#define SYSCTL_CLOCK_CLK_TOP_XRAM (49UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA0 (50UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA1 (51UL)
#define SYSCTL_CLOCK_CLK_TOP_AUD0 (52UL)
#define SYSCTL_CLOCK_CLK_TOP_AUD1 (53UL)
#define SYSCTL_CLOCK_CLK_TOP_AUD2 (54UL)
#define SYSCTL_CLOCK_CLK_TOP_AUD3 (55UL)
#define SYSCTL_CLOCK_CLK_TOP_ETH0 (56UL)
#define SYSCTL_CLOCK_CLK_TOP_PTP0 (57UL)
#define SYSCTL_CLOCK_CLK_TOP_SDC0 (58UL)
#define SYSCTL_CLOCK_CLK_TOP_SDC1 (59UL)
#define SYSCTL_CLOCK_CLK_TOP_NTM0 (60UL)
#define SYSCTL_CLOCK_CLK_TOP_REF0 (61UL)
#define SYSCTL_CLOCK_CLK_TOP_REF1 (62UL)
#define SYSCTL_CLOCK_CLK_TOP_CAM0 (63UL)
#define SYSCTL_CLOCK_CLK_TOP_CAM1 (64UL)
#define SYSCTL_CLOCK_CLK_TOP_LCD0 (65UL)
#define SYSCTL_CLOCK_CLK_TOP_LCD1 (66UL)
#define SYSCTL_CLOCK_CLK_TOP_CSI0 (67UL)
#define SYSCTL_CLOCK_CLK_TOP_CSI1 (68UL)

/* ADCCLK register group index macro definition */
#define SYSCTL_ADCCLK_CLK_TOP_ADC0 (0UL)
#define SYSCTL_ADCCLK_CLK_TOP_ADC1 (1UL)

/* I2SCLK register group index macro definition */
#define SYSCTL_I2SCLK_CLK_TOP_I2S0 (0UL)
#define SYSCTL_I2SCLK_CLK_TOP_I2S1 (1UL)
#define SYSCTL_I2SCLK_CLK_TOP_I2S2 (2UL)
#define SYSCTL_I2SCLK_CLK_TOP_I2S3 (3UL)

/* MONITOR register group index macro definition */
#define SYSCTL_MONITOR_SLICE0 (0UL)
#define SYSCTL_MONITOR_SLICE1 (1UL)
#define SYSCTL_MONITOR_SLICE2 (2UL)
#define SYSCTL_MONITOR_SLICE3 (3UL)

/* GPR register group index macro definition */
#define SYSCTL_CPU_GPR_GPR0 (0UL)
#define SYSCTL_CPU_GPR_GPR1 (1UL)
#define SYSCTL_CPU_GPR_GPR2 (2UL)
#define SYSCTL_CPU_GPR_GPR3 (3UL)
#define SYSCTL_CPU_GPR_GPR4 (4UL)
#define SYSCTL_CPU_GPR_GPR5 (5UL)
#define SYSCTL_CPU_GPR_GPR6 (6UL)
#define SYSCTL_CPU_GPR_GPR7 (7UL)
#define SYSCTL_CPU_GPR_GPR8 (8UL)
#define SYSCTL_CPU_GPR_GPR9 (9UL)
#define SYSCTL_CPU_GPR_GPR10 (10UL)
#define SYSCTL_CPU_GPR_GPR11 (11UL)
#define SYSCTL_CPU_GPR_GPR12 (12UL)
#define SYSCTL_CPU_GPR_GPR13 (13UL)

/* WAKEUP_STATUS register group index macro definition */
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS0 (0UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS1 (1UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS2 (2UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS3 (3UL)

/* WAKEUP_ENABLE register group index macro definition */
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE0 (0UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE1 (1UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE2 (2UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE3 (3UL)

/* CPU register group index macro definition */
#define SYSCTL_CPU_CPU0 (0UL)


#endif /* HPM_SYSCTL_H */
